openwch/arduino_core_ch32/system/CH32X035/SRC/Peripheral/inc/ch32x035.h
/********************************** (C) COPYRIGHT  *******************************
 * File Name          : ch32x035.h
 * Author             : WCH
 * Version            : V1.0.1
 * Date               : 2024/10/28
 * Description        : CH32X035 Device Peripheral Access Layer Header File.
*********************************************************************************
* Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#ifndef __CH32X035_H
#define __CH32X035_H

#ifdef __cplusplus
extern "C" {
#endif

#define __MPU_PRESENT             0                   /* Other CH32 devices does not provide an MPU */
#define __Vendor_SysTickConfig    0                   /* Set to 1 if different SysTick Config is used */

#define HSI_VALUE              ((uint32_t)48000000) /* Value of the Internal oscillator in Hz */

/* Standard Peripheral Library version number */
#define __STDPERIPH_VERSION_MAIN   (0x01) /* [15:8] main version */
#define __STDPERIPH_VERSION_SUB    (0x08) /* [7:0] sub version */
#define __STDPERIPH_VERSION        ((__STDPERIPH_VERSION_MAIN << 8)\
                                    |(__STDPERIPH_VERSION_SUB << 0))


/* Interrupt Number Definition, according to the selected device */
typedef enum IRQn
{
    /******  RISC-V Processor Exceptions Numbers *******************************************************/
    NonMaskableInt_IRQn = 2,   /* 2 Non Maskable Interrupt                             */
    EXC_IRQn = 3,              /* 3 Exception Interrupt                                */
    Ecall_M_Mode_IRQn = 5,     /* 5 Ecall M Mode Interrupt                             */
    Ecall_U_Mode_IRQn = 8,     /* 8 Ecall U Mode Interrupt                             */
    Break_Point_IRQn = 9,      /* 9 Break Point Interrupt                              */
    SysTick_IRQn = 12,         /* 12 System timer Interrupt                            */
    Software_IRQn = 14,        /* 14 software Interrupt                                */

    /******  RISC-V specific Interrupt Numbers *********************************************************/
    WWDG_IRQn = 16,            /* Window WatchDog Interrupt                            */
    PVD_IRQn = 17,             /* PVD through EXTI Line detection Interrupt            */
    FLASH_IRQn = 18,           /* FLASH global Interrupt                               */
    EXTI7_0_IRQn = 20,         /* External Line[7:0] Interrupts                        */
    AWU_IRQn = 21,             /* AWU global Interrupt                                 */
    DMA1_Channel1_IRQn = 22,   /* DMA1 Channel 1 global Interrupt                      */
    DMA1_Channel2_IRQn = 23,   /* DMA1 Channel 2 global Interrupt                      */
    DMA1_Channel3_IRQn = 24,   /* DMA1 Channel 3 global Interrupt                      */
    DMA1_Channel4_IRQn = 25,   /* DMA1 Channel 4 global Interrupt                      */
    DMA1_Channel5_IRQn = 26,   /* DMA1 Channel 5 global Interrupt                      */
    DMA1_Channel6_IRQn = 27,   /* DMA1 Channel 6 global Interrupt                      */
    DMA1_Channel7_IRQn = 28,   /* DMA1 Channel 7 global Interrupt                      */
    ADC1_IRQn = 29,            /* ADC1 global Interrupt                                */
    I2C1_EV_IRQn = 30,         /* I2C1 Event Interrupt                                 */
    I2C1_ER_IRQn = 31,         /* I2C1 Error Interrupt                                 */
    USART1_IRQn = 32,          /* USART1 global Interrupt                              */
    SPI1_IRQn = 33,            /* SPI1 global Interrupt                                */
    TIM1_BRK_IRQn = 34,        /* TIM1 Break Interrupt                                 */
    TIM1_UP_IRQn = 35,         /* TIM1 Update Interrupt                                */
    TIM1_TRG_COM_IRQn = 36,    /* TIM1 Trigger and Commutation Interrupt               */
    TIM1_CC_IRQn = 37,         /* TIM1 Capture Compare Interrupt                       */
    TIM2_UP_IRQn = 38,         /* TIM2 Update Interrupt                                */
    USART2_IRQn = 39,          /* USART2 global Interrupt                              */
    EXTI15_8_IRQn = 40,        /* External Line[15:8] Interrupts                       */
    EXTI25_16_IRQn = 41,       /* External Line[25:16] Interrupts                      */
    USART3_IRQn = 42,          /* USART3 global Interrupt                              */
    USART4_IRQn = 43,          /* USART4 global Interrupt                              */
    DMA1_Channel8_IRQn = 44,   /* DMA1 Channel 8 global Interrupt                      */
    USBFS_IRQn = 45,           /* USBFS Host/Device global Interrupt                   */
    USBFSWakeUp_IRQn = 46,     /* USBFS Host/Device WakeUp Interrupt                   */
    PIOC_IRQn = 47,            /* PIOC global Interrupt                                */
    OPA_IRQn = 48,             /* OPA global Interrupt                                 */
    USBPD_IRQn = 49,           /* USBPD global Interrupt                               */
    USBPDWakeUp_IRQn = 50,     /* USBPD WakeUp Interrupt                               */
    TIM2_CC_IRQn = 51,         /* TIM2 Capture Compare Interrupt                       */
    TIM2_TRG_COM_IRQn = 52,    /* TIM2 Trigger and Commutation Interrupt               */
    TIM2_BRK_IRQn = 53,        /* TIM2 Break Interrupt                                 */
    TIM3_IRQn = 54,            /* TIM3 global Interrupt                                */
} IRQn_Type;

#define HardFault_IRQn    EXC_IRQn
#define SysTicK_IRQn      SysTick_IRQn

#include <stdint.h>
#include "core_riscv.h"
#include "system_ch32x035.h"

/* Standard Peripheral Library old definitions (maintained for legacy purpose) */
#define HSI_Value             HSI_VALUE

/* Analog to Digital Converter */
typedef struct
{
    __IO uint32_t STATR;
    __IO uint32_t CTLR1;
    __IO uint32_t CTLR2;
    __IO uint32_t SAMPTR1;
    __IO uint32_t SAMPTR2;
    __IO uint32_t IOFR1;
    __IO uint32_t IOFR2;
    __IO uint32_t IOFR3;
    __IO uint32_t IOFR4;
    __IO uint32_t WDHTR;
    __IO uint32_t WDLTR;
    __IO uint32_t RSQR1;
    __IO uint32_t RSQR2;
    __IO uint32_t RSQR3;
    __IO uint32_t ISQR;
    __IO uint32_t IDATAR1;
    __IO uint32_t IDATAR2;
    __IO uint32_t IDATAR3;
    __IO uint32_t IDATAR4;
    __IO uint32_t RDATAR;
    __IO uint32_t CTLR3;
    __IO uint32_t WDTR1;
    __IO uint32_t WDTR2;
    __IO uint32_t WDTR3;
} ADC_TypeDef;

/* DMA Channel Controller */
typedef struct
{
    __IO uint32_t CFGR;
    __IO uint32_t CNTR;
    __IO uint32_t PADDR;
    __IO uint32_t MADDR;
} DMA_Channel_TypeDef;

/* DMA Controller */
typedef struct
{
    __IO uint32_t INTFR;
    __IO uint32_t INTFCR;
} DMA_TypeDef;

/* External Interrupt/Event Controller */
typedef struct
{
    __IO uint32_t INTENR;
    __IO uint32_t EVENR;
    __IO uint32_t RTENR;
    __IO uint32_t FTENR;
    __IO uint32_t SWIEVR;
    __IO uint32_t INTFR;
} EXTI_TypeDef;

/* FLASH Registers */
typedef struct
{
    __IO uint32_t ACTLR;
    __IO uint32_t KEYR;
    __IO uint32_t OBKEYR;
    __IO uint32_t STATR;
    __IO uint32_t CTLR;
    __IO uint32_t ADDR;
    uint32_t      RESERVED;
    __IO uint32_t OBR;
    __IO uint32_t WPR;
    __IO uint32_t MODEKEYR;
    __IO uint32_t BOOT_MODEKEYR;
} FLASH_TypeDef;

/* Option Bytes Registers */
typedef struct
{
    __IO uint16_t RDPR;
    __IO uint16_t USER;
    __IO uint16_t Data0;
    __IO uint16_t Data1;
    __IO uint16_t WRPR0;
    __IO uint16_t WRPR1;
    __IO uint16_t WRPR2;
    __IO uint16_t WRPR3;
} OB_TypeDef;

