openwch/arduino_core_ch32/system/CH32X035/SRC/Peripheral/inc/ch32x035.h
/* General Purpose I/O */
typedef struct
{
    __IO uint32_t CFGLR;
    __IO uint32_t CFGHR;
    __IO uint32_t INDR;
    __IO uint32_t OUTDR;
    __IO uint32_t BSHR;
    __IO uint32_t BCR;
    __IO uint32_t LCKR;
    __IO uint32_t CFGXR;
    __IO uint32_t BSXR;
} GPIO_TypeDef;

/* Alternate Function I/O */
typedef struct
{
    uint32_t      RESERVED0;
    __IO uint32_t PCFR1;
    __IO uint32_t EXTICR[2];
    uint32_t      RESERVED1;
    uint32_t      RESERVED2;
    __IO uint32_t CTLR;
} AFIO_TypeDef;

/* Inter Integrated Circuit Interface */
typedef struct
{
    __IO uint16_t CTLR1;
    uint16_t      RESERVED0;
    __IO uint16_t CTLR2;
    uint16_t      RESERVED1;
    __IO uint16_t OADDR1;
    uint16_t      RESERVED2;
    __IO uint16_t OADDR2;
    uint16_t      RESERVED3;
    __IO uint16_t DATAR;
    uint16_t      RESERVED4;
    __IO uint16_t STAR1;
    uint16_t      RESERVED5;
    __IO uint16_t STAR2;
    uint16_t      RESERVED6;
    __IO uint16_t CKCFGR;
    uint16_t      RESERVED7;
} I2C_TypeDef;

/* Independent WatchDog */
typedef struct
{
    __IO uint32_t CTLR;
    __IO uint32_t PSCR;
    __IO uint32_t RLDR;
    __IO uint32_t STATR;
} IWDG_TypeDef;

/* Power Control */
typedef struct
{
    __IO uint32_t CTLR;
    __IO uint32_t CSR;
} PWR_TypeDef;

/* Reset and Clock Control */
typedef struct
{
    __IO uint32_t CTLR;
    __IO uint32_t CFGR0;
    __IO uint32_t RESERVED0;
    __IO uint32_t APB2PRSTR;
    __IO uint32_t APB1PRSTR;
    __IO uint32_t AHBPCENR;
    __IO uint32_t APB2PCENR;
    __IO uint32_t APB1PCENR;
    __IO uint32_t RESERVED1;
    __IO uint32_t RSTSCKR;
    __IO uint32_t AHBRSTR;
} RCC_TypeDef;

/* Serial Peripheral Interface */
typedef struct
{
    __IO uint16_t CTLR1;
    uint16_t      RESERVED0;
    __IO uint16_t CTLR2;
    uint16_t      RESERVED1;
    __IO uint16_t STATR;
    uint16_t      RESERVED2;
    __IO uint16_t DATAR;
    uint16_t      RESERVED3;
    __IO uint16_t CRCR;
    uint16_t      RESERVED4;
    __IO uint16_t RCRCR;
    uint16_t      RESERVED5;
    __IO uint16_t TCRCR;
    uint16_t      RESERVED6;
    uint32_t      RESERVED7;
    uint32_t      RESERVED8;
    __IO uint16_t HSCR;
    uint16_t      RESERVED9;
} SPI_TypeDef;

/* TIM */
typedef struct
{
    __IO uint16_t CTLR1;
    uint16_t      RESERVED0;
    __IO uint16_t CTLR2;
    uint16_t      RESERVED1;
    __IO uint16_t SMCFGR;
    uint16_t      RESERVED2;
    __IO uint16_t DMAINTENR;
    uint16_t      RESERVED3;
    __IO uint16_t INTFR;
    uint16_t      RESERVED4;
    __IO uint16_t SWEVGR;
    uint16_t      RESERVED5;
    __IO uint16_t CHCTLR1;
    uint16_t      RESERVED6;
    __IO uint16_t CHCTLR2;
    uint16_t      RESERVED7;
    __IO uint16_t CCER;
    uint16_t      RESERVED8;
    __IO uint16_t CNT;
    uint16_t      RESERVED9;
    __IO uint16_t PSC;
    uint16_t      RESERVED10;
    __IO uint16_t ATRLR;
    uint16_t      RESERVED11;
    __IO uint16_t RPTCR;
    uint16_t      RESERVED12;
    union
    {
        __IO uint32_t CH1CVR_R32;
        struct
        {
            __IO uint16_t CH1CVR;
            uint16_t      RESERVED13;
        };
    };
    union
    {
        __IO uint32_t CH2CVR__R32;
        struct
        {
            __IO uint16_t CH2CVR;
            uint16_t      RESERVED14;
        };
    };
    union
    {
        __IO uint32_t CH3CVR__R32;
        struct
        {
            __IO uint16_t CH3CVR;
            uint16_t      RESERVED15;
        };
    };
    union
    {
        __IO uint32_t CH4CVR__R32;
        struct
        {
            __IO uint16_t CH4CVR;
            uint16_t      RESERVED16;
        };
    };
    __IO uint16_t BDTR;
    uint16_t      RESERVED17;
    __IO uint16_t DMACFGR;
    uint16_t      RESERVED18;
    __IO uint16_t DMAADR;
    uint16_t      RESERVED19;
    __IO uint16_t SPEC;
    uint16_t      RESERVED20;
} TIM_TypeDef;

/* Universal Synchronous Asynchronous Receiver Transmitter */
typedef struct
{
    __IO uint16_t STATR;
    uint16_t      RESERVED0;
    __IO uint16_t DATAR;
    uint16_t      RESERVED1;
    __IO uint16_t BRR;
    uint16_t      RESERVED2;
    __IO uint16_t CTLR1;
    uint16_t      RESERVED3;
    __IO uint16_t CTLR2;
    uint16_t      RESERVED4;
    __IO uint16_t CTLR3;
    uint16_t      RESERVED5;
    __IO uint16_t GPR;
    uint16_t      RESERVED6;
} USART_TypeDef;

/* Window WatchDog */
typedef struct
{
    __IO uint32_t CTLR;
    __IO uint32_t CFGR;
    __IO uint32_t STATR;
} WWDG_TypeDef;

/* OPA Registers */
typedef struct
{
    __IO uint16_t CFGR1;
    __IO uint16_t CFGR2;
    __IO uint32_t CTLR1;
    __IO uint32_t CTLR2;
    __IO uint32_t OPAKEY;
    __IO uint32_t CMPKEY;
    __IO uint32_t POLLKEY;
} OPA_TypeDef;

/* AWU Registers */
typedef struct
{
    __IO uint32_t CSR;
    __IO uint32_t WR;
    __IO uint32_t PSC;
} AWU_TypeDef;

/* PD Registers */

typedef struct
{
    union
    {
        __IO uint32_t USBPD_CONFIG;
        struct
        {
            __IO uint16_t CONFIG;
            __IO uint16_t BMC_CLK_CNT;
        };
    };
    union
    {
        __IO uint32_t USBPD_CONTROL;
        struct
        {
            union
            {
                __IO uint16_t R16_CONTROL;
                struct
                {
                    __IO uint8_t  CONTROL;
                    __IO uint8_t  TX_SEL;
                };
            };
            __IO uint16_t BMC_TX_SZ;
        };
    };
    union
    {
        __IO uint32_t USBPD_STATUS;
        struct
        {
            union
            {
                __IO uint16_t R16_STATUS;
                struct
                {
                    __IO uint8_t  DATA_BUF;
                    __IO uint8_t  STATUS;
                };
            };
            __IO uint16_t BMC_BYTE_CNT;
        };
    };
    union
    {
        __IO uint32_t USBPD_PORT;
        struct
        {
            __IO uint16_t PORT_CC1;
            __IO uint16_t PORT_CC2;
        };
    };
    union
    {
        __IO uint32_t USBPD_DMA;
        struct
        {
            __IO uint16_t DMA;
            __IO uint16_t RESERVED;
        };
    };
} USBPD_TypeDef;

/* USBFS Registers */
typedef struct
{
    __IO uint8_t  BASE_CTRL;
    __IO uint8_t  UDEV_CTRL;
    __IO uint8_t  INT_EN;
    __IO uint8_t  DEV_ADDR;
    uint8_t       RESERVED0;
    __IO uint8_t  MIS_ST;
    __IO uint8_t  INT_FG;
    __IO uint8_t  INT_ST;
    __IO uint32_t RX_LEN;
    __IO uint8_t  UEP4_1_MOD;
    __IO uint8_t  UEP2_3_MOD;
    __IO uint8_t  UEP567_MOD;
    uint8_t       RESERVED1;
    __IO uint32_t UEP0_DMA;
    __IO uint32_t UEP1_DMA;
    __IO uint32_t UEP2_DMA;
    __IO uint32_t UEP3_DMA;
    union{
        __IO uint32_t  UEP0_CTRL;
        struct{
            __IO uint16_t  UEP0_TX_LEN;
            __IO uint16_t  UEP0_CTRL_H;
        };
    };
    union{
        __IO uint32_t  UEP1_CTRL;
        struct{
            __IO uint16_t  UEP1_TX_LEN;
            __IO uint16_t  UEP1_CTRL_H;
        };
    };
    union{
        __IO uint32_t  UEP2_CTRL;
        struct{
            __IO uint16_t  UEP2_TX_LEN;
            __IO uint16_t  UEP2_CTRL_H;
        };
    };
    union{
        __IO uint32_t  UEP3_CTRL;
        struct{
            __IO uint16_t  UEP3_TX_LEN;
            __IO uint16_t  UEP3_CTRL_H;
        };
    };
    union{
        __IO uint32_t  UEP4_CTRL;
        struct{
            __IO uint16_t  UEP4_TX_LEN;
            __IO uint16_t  UEP4_CTRL_H;
        };
    };
    uint32_t      RESERVED2;
    uint32_t      RESERVED3;
    uint32_t      RESERVED4;
    uint32_t      RESERVED5;
    uint32_t      RESERVED6;
    uint32_t      RESERVED7;
    uint32_t      RESERVED8;
    uint32_t      RESERVED9;
    __IO uint32_t UEP5_DMA;
    __IO uint32_t UEP6_DMA;
    __IO uint32_t UEP7_DMA;
    uint32_t      RESERVED10;
    union{
        __IO uint32_t  UEP5_CTRL;
        struct{
            __IO uint16_t  UEP5_TX_LEN;
            __IO uint16_t  UEP5_CTRL_H;
        };
    };
    union{
        __IO uint32_t  UEP6_CTRL;
        struct{
            __IO uint16_t  UEP6_TX_LEN;
            __IO uint16_t  UEP6_CTRL_H;
        };
    };
    union{
        __IO uint32_t  UEP7_CTRL;
        struct{
            __IO uint16_t  UEP7_TX_LEN;
            __IO uint16_t  UEP7_CTRL_H;
        };
    };
    __IO uint32_t UEPX_MOD;
} USBFSD_TypeDef;

typedef struct
{
    __IO uint8_t   BASE_CTRL;
    __IO uint8_t   HOST_CTRL;
    __IO uint8_t   INT_EN;
    __IO uint8_t   DEV_ADDR;
    uint8_t        RESERVED0;
    __IO uint8_t   MIS_ST;
    __IO uint8_t   INT_FG;
    __IO uint8_t   INT_ST;
    __IO uint16_t  RX_LEN;
    uint16_t       RESERVED1;
    uint8_t        RESERVED2;
    __IO uint8_t   HOST_EP_MOD;
    uint16_t       RESERVED3;
    uint32_t       RESERVED4;
    uint32_t       RESERVED5;
    __IO uint16_t  HOST_RX_DMA;
    uint16_t       RESERVED6;
    __IO uint16_t  HOST_TX_DMA;
    uint16_t       RESERVED7;
    uint32_t       RESERVED8;
    uint16_t       RESERVED9;
    __IO uint8_t   HOST_SETUP;
    uint8_t        RESERVED10;
    __IO uint8_t   HOST_EP_PID;
    uint8_t        RESERVED11;
    __IO uint8_t   HOST_RX_CTRL;
    uint8_t        RESERVED12;
    __IO uint8_t   HOST_TX_LEN;
    uint8_t        RESERVED13;
    __IO uint8_t   HOST_TX_CTRL;
    uint8_t        RESERVED14;
} USBFSH_TypeDef;

/* Peripheral memory map */
#define FLASH_BASE                              ((uint32_t)0x08000000) /* FLASH base address in the alias region */
#define SRAM_BASE                               ((uint32_t)0x20000000) /* SRAM base address in the alias region */
#define PERIPH_BASE                             ((uint32_t)0x40000000) /* Peripheral base address in the alias region */

#define APB1PERIPH_BASE                         (PERIPH_BASE)
#define APB2PERIPH_BASE                         (PERIPH_BASE + 0x10000)
#define AHBPERIPH_BASE                          (PERIPH_BASE + 0x20000)

#define TIM2_BASE                               (APB1PERIPH_BASE + 0x0000)
#define TIM3_BASE                               (APB1PERIPH_BASE + 0x0400)
#define WWDG_BASE                               (APB1PERIPH_BASE + 0x2C00)
#define IWDG_BASE                               (APB1PERIPH_BASE + 0x3000)
#define USART2_BASE                             (APB1PERIPH_BASE + 0x4400)
#define USART3_BASE                             (APB1PERIPH_BASE + 0x4800)
#define USART4_BASE                             (APB1PERIPH_BASE + 0x4C00)
#define I2C1_BASE                               (APB1PERIPH_BASE + 0x5400)
#define PWR_BASE                                (APB1PERIPH_BASE + 0x7000)

#define AFIO_BASE                               (APB2PERIPH_BASE + 0x0000)
#define EXTI_BASE                               (APB2PERIPH_BASE + 0x0400)
#define GPIOA_BASE                              (APB2PERIPH_BASE + 0x0800)
#define GPIOB_BASE                              (APB2PERIPH_BASE + 0x0C00)
#define GPIOC_BASE                              (APB2PERIPH_BASE + 0x1000)
#define ADC1_BASE                               (APB2PERIPH_BASE + 0x2400)
#define TIM1_BASE                               (APB2PERIPH_BASE + 0x2C00)
#define SPI1_BASE                               (APB2PERIPH_BASE + 0x3000)
#define USART1_BASE                             (APB2PERIPH_BASE + 0x3800)

#define DMA1_BASE                               (AHBPERIPH_BASE + 0x0000)
#define DMA1_Channel1_BASE                      (AHBPERIPH_BASE + 0x0008)
#define DMA1_Channel2_BASE                      (AHBPERIPH_BASE + 0x001C)
#define DMA1_Channel3_BASE                      (AHBPERIPH_BASE + 0x0030)
#define DMA1_Channel4_BASE                      (AHBPERIPH_BASE + 0x0044)
#define DMA1_Channel5_BASE                      (AHBPERIPH_BASE + 0x0058)
#define DMA1_Channel6_BASE                      (AHBPERIPH_BASE + 0x006C)
#define DMA1_Channel7_BASE                      (AHBPERIPH_BASE + 0x0080)
#define DMA1_Channel8_BASE                      (AHBPERIPH_BASE + 0x0094)
#define RCC_BASE                                (AHBPERIPH_BASE + 0x1000)
#define FLASH_R_BASE                            (AHBPERIPH_BASE + 0x2000)
#define USBFS_BASE                              (AHBPERIPH_BASE + 0x3400)
#define OPA_BASE                                (AHBPERIPH_BASE + 0x6000)
#define AWU_BASE                                (AHBPERIPH_BASE + 0x6400)
#define PIOC_BASE                               (AHBPERIPH_BASE + 0x6C00)
#define USBPD_BASE                              (AHBPERIPH_BASE + 0x7000)

#define OB_BASE                                 ((uint32_t)0x1FFFF800)

