openwch/arduino_core_ch32/system/CH32X035/SRC/Peripheral/inc/ch32x035.h
/*******************  Bit definition for WWDG_CTLR register  ********************/
#define WWDG_CTLR_T                             ((uint8_t)0x7F) /* T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define WWDG_CTLR_T0                            ((uint8_t)0x01) /* Bit 0 */
#define WWDG_CTLR_T1                            ((uint8_t)0x02) /* Bit 1 */
#define WWDG_CTLR_T2                            ((uint8_t)0x04) /* Bit 2 */
#define WWDG_CTLR_T3                            ((uint8_t)0x08) /* Bit 3 */
#define WWDG_CTLR_T4                            ((uint8_t)0x10) /* Bit 4 */
#define WWDG_CTLR_T5                            ((uint8_t)0x20) /* Bit 5 */
#define WWDG_CTLR_T6                            ((uint8_t)0x40) /* Bit 6 */

#define WWDG_CTLR_WDGA                          ((uint8_t)0x80) /* Activation bit */

/*******************  Bit definition for WWDG_CFGR register  *******************/
#define WWDG_CFGR_W                             ((uint16_t)0x007F) /* W[6:0] bits (7-bit window value) */
#define WWDG_CFGR_W0                            ((uint16_t)0x0001) /* Bit 0 */
#define WWDG_CFGR_W1                            ((uint16_t)0x0002) /* Bit 1 */
#define WWDG_CFGR_W2                            ((uint16_t)0x0004) /* Bit 2 */
#define WWDG_CFGR_W3                            ((uint16_t)0x0008) /* Bit 3 */
#define WWDG_CFGR_W4                            ((uint16_t)0x0010) /* Bit 4 */
#define WWDG_CFGR_W5                            ((uint16_t)0x0020) /* Bit 5 */
#define WWDG_CFGR_W6                            ((uint16_t)0x0040) /* Bit 6 */

#define WWDG_CFGR_WDGTB                         ((uint16_t)0x0180) /* WDGTB[1:0] bits (Timer Base) */
#define WWDG_CFGR_WDGTB0                        ((uint16_t)0x0080) /* Bit 0 */
#define WWDG_CFGR_WDGTB1                        ((uint16_t)0x0100) /* Bit 1 */

#define WWDG_CFGR_EWI                           ((uint16_t)0x0200) /* Early Wakeup Interrupt */

/*******************  Bit definition for WWDG_STATR register  ********************/
#define WWDG_STATR_EWIF                         ((uint8_t)0x01) /* Early Wakeup Interrupt Flag */

/******************************************************************************/
/*                              OPA and CMP                                   */
/******************************************************************************/

/*******************  Bit definition for OPA_CFGR1 register  ********************/
#define OPA_CFGR1_POLL_EN1                      ((uint16_t)0x0001)
#define OPA_CFGR1_POLL_EN2                      ((uint16_t)0x0002)
#define OPA_CFGR1_BKIN_EN1                      ((uint16_t)0x0004)
#define OPA_CFGR1_BKIN_EN2                      ((uint16_t)0x0008)
#define OPA_CFGR1_RST_EN1                       ((uint16_t)0x0010)
#define OPA_CFGR1_RST_EN2                       ((uint16_t)0x0020)
#define OPA_CFGR1_BKIN_SEL                      ((uint16_t)0x0040)
#define OPA_CFGR1_POLL_LOCK                     ((uint16_t)0x0080)
#define OPA_CFGR1_IE_OUT1                       ((uint16_t)0x0100)
#define OPA_CFGR1_IE_OUT2                       ((uint16_t)0x0200)
#define OPA_CFGR1_IE_CNT                        ((uint16_t)0x0400)
#define OPA_CFGR1_NMI_EN                        ((uint16_t)0x0800)
#define OPA_CFGR1_IF_OUT1                       ((uint16_t)0x1000)
#define OPA_CFGR1_IF_OUT2                       ((uint16_t)0x2000)
#define OPA_CFGR1_IF_CNT                        ((uint16_t)0x4000)

/*******************  Bit definition for OPA_CFGR2 register  ********************/
#define OPA_CFGR2_POLL_VLU                      ((uint16_t)0x01FF)
#define OPA_CFGR2_POLL1_NUM                     ((uint16_t)0x0600)
#define OPA_CFGR2_POLL2_NUM                     ((uint16_t)0x1800)

/*******************  Bit definition for OPA_CTLR1 register  ********************/
#define OPA_CTLR1_EN1                           ((uint32_t)0x00000001)
#define OPA_CTLR1_MODE1                         ((uint32_t)0x00000002)

#define OPA_CTLR1_PSEL1                         ((uint32_t)0x00000018)

#define OPA_CTLR1_FB_EN1                        ((uint32_t)0x00000020)
#define OPA_CTLR1_NSEL1                         ((uint32_t)0x000001C0)

#define OPA_CTLR1_EN2                           ((uint32_t)0x00010000)
#define OPA_CTLR1_MODE2                         ((uint32_t)0x00020000)

#define OPA_CTLR1_PSEL2                         ((uint32_t)0x00180000)

#define OPA_CTLR1_FB_EN2                        ((uint32_t)0x00200000)
#define OPA_CTLR1_NSEL2                         ((uint32_t)0x01C00000)

#define OPA_CTLR1_OPA_LOCK                      ((uint32_t)0x80000000)

/*******************  Bit definition for OPA_CTLR2 register  ********************/
#define OPA_CTLR2_EN1                           ((uint32_t)0x00000001)
#define OPA_CTLR2_MODE1                         ((uint32_t)0x00000002)
#define OPA_CTLR2_NSEL1                         ((uint32_t)0x00000004)
#define OPA_CTLR2_PSEL1                         ((uint32_t)0x00000008)

#define OPA_CTLR2_EN2                           ((uint32_t)0x00000020)
#define OPA_CTLR2_MODE2                         ((uint32_t)0x00000040)
#define OPA_CTLR2_NSEL2                         ((uint32_t)0x00000080)
#define OPA_CTLR2_PSEL2                         ((uint32_t)0x00000100)

#define OPA_CTLR2_EN3                           ((uint32_t)0x00000400)
#define OPA_CTLR2_MODE3                         ((uint32_t)0x00000800)
#define OPA_CTLR2_NSEL3                         ((uint32_t)0x00001000)
#define OPA_CTLR2_PSEL3                         ((uint32_t)0x00002000)

#define OPA_CTLR2_CMP_LOCK                      ((uint32_t)0x00002000)

/*******************  Bit definition for OPA_KEY register  ********************/
#define OPA_KEY                                 ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for CMP_KEY register  ********************/
#define CMP_KEY                                 ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for POLL_KEY register  ********************/
#define POLL_KEY                                ((uint32_t)0xFFFFFFFF)

#include "ch32x035_conf.h"

#ifdef __cplusplus
}
#endif

#endif
